# Module 1 - Introduction to Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- Why use Pandas? 
 
 (a) Provides methods able analyze data stored in the format Data Scientist most often encounter (.csv, .tsv, or .xlsx). 
 
 (b) Makes it very convenient to load, process, and analyze in the aforementioned formats. 
 
 (c) Along with python visualization packages allows for the visual analysis of tabular data.
 

- When do we want to use NumPy versus Pandas?
- What are the [advantages of using Pandas?](https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/)
- What are the [disadvantages of using Pandas?](https://wesmckinney.com/blog/apache-arrow-pandas-internals/)
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### Activation:

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [1]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/Users/flatironschool/course_materials/module1/section01/code/dc-ds-100719/module-1/week-1/day-5-pandas-1
total 56
drwxr-xr-x  5 flatironschool  staff    160 Oct 11 11:09 .
drwxr-xr-x  7 flatironschool  staff    224 Oct 11 11:05 ..
drwxr-xr-x  3 flatironschool  staff     96 Oct 11 11:09 .ipynb_checkpoints
drwxr-xr-x  4 flatironschool  staff    128 Oct 11 11:05 data
-rw-r--r--  1 flatironschool  staff  25472 Oct 11 11:09 pandas-1.ipynb

In [3]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [4]:
!head data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [6]:
example_csv.head()

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [12]:
#read in your csv here!

jobs = pd.read_csv('data/made_up_jobs.csv')

#remember that it's nice to be able to look at your data, so let's do that here, too.

print(jobs.shape)
jobs.head()
jobs

(6, 4)

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

You can also load in data by using the url of an associated dataset.

In [14]:
shelter_data = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
# this link is copied directly from the download option for CSV

shelter_data.head(20)

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A800276,Porkchop,10/10/2019 07:30:00 PM,10/10/2019 07:30:00 PM,09/19/2004,Return to Owner,NaN,Dog,Intact Male,15 years,Australian Cattle Dog,Tan
1,A806032,NaN,10/10/2019 06:25:00 PM,10/10/2019 06:25:00 PM,07/21/2019,Adoption,NaN,Cat,Intact Female,2 months,Domestic Shorthair,Black/White
2,A806431,NaN,10/10/2019 06:13:00 PM,10/10/2019 06:13:00 PM,09/18/2019,Transfer,Partner,Cat,Unknown,3 weeks,Domestic Shorthair,Black
3,A806432,NaN,10/10/2019 06:13:00 PM,10/10/2019 06:13:00 PM,09/18/2019,Transfer,Partner,Cat,Unknown,3 weeks,Domestic Shorthair,Brown Tabby
4,A806149,*Bingley,10/10/2019 05:59:00 PM,10/10/2019 05:59:00 PM,10/06/2017,Adoption,NaN,Dog,Neutered Male,2 years,Basset Hound/American Pit Bull Terrier,Brown Tiger/White
5,A805097,*Margy,10/10/2019 05:55:00 PM,10/10/2019 05:55:00 PM,04/29/2019,Adoption,NaN,Dog,Spayed Female,5 months,Catahoula Mix,White
6,A806147,Calypso,10/10/2019 05:55:00 PM,10/10/2019 05:55:00 PM,11/06/2018,Adoption,NaN,Dog,Spayed Female,11 months,German Shepherd Mix,Black/Brown
7,A805516,Squeeky,10/10/2019 05:45:00 PM,10/10/2019 05:45:00 PM,07/01/2019,Adoption,NaN,Cat,Spayed Female,3 months,Domestic Medium Hair,Blue
8,A805911,*Duck,10/10/2019 05:18:00 PM,10/10/2019 05:18:00 PM,07/03/2019,Adoption,NaN,Cat,Neutered Male,3 months,Siamese,Flame Point
9,A805562,Kismet,10/10/2019 05:10:00 PM,10/10/2019 05:10:00 PM,09/28/2017,Adoption,NaN,Cat,Spayed Female,2 years,Domestic Medium Hair,Tortie
10,A614097,Capone,10/10/2019 05:09:00 PM,10/10/2019 05:09:00 PM,11/16/2008,Return to Owner,NaN,Dog,Neutered Male,10 years,American Pit Bull Terrier,Brown Brindle/White
11,A805953,NaN,10/10/2019 05:08:00 PM,10/10/2019 05:08:00 PM,07/22/2019,Adoption,NaN,Dog,Neutered Male,2 months,Pit Bull,Brown/White
12,A806215,NaN,10/10/2019 04:54:00 PM,10/10/2019 04:54:00 PM,07/07/2019,Adoption,NaN,Cat,Spayed Female,3 months,Domestic Shorthair,Blue Tabby
13,A806174,Diamond,10/10/2019 04:41:00 PM,10/10/2019 04:41:00 PM,07/22/2019,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Medium Hair,Orange Tabby/White
14,A806330,Roxy,10/10/2019 04:10:00 PM,10/10/2019 04:10:00 PM,10/08/2016,Return to Owner,NaN,Dog,Spayed Female,3 years,Border Collie,White/Black
15,A805638,Lane,10/10/2019 04:09:00 PM,10/10/2019 04:09:00 PM,09/29/2013,Adoption,NaN,Dog,Spayed Female,6 years,American Staffordshire Terrier/American Bulldog,Red
16,A805796,NaN,10/10/2019 04:07:00 PM,10/10/2019 04:07:00 PM,10/02/2014,Transfer,Partner,Dog,Neutered Male,5 years,Chihuahua Shorthair,Black/White
17,A805311,NaN,10/10/2019 03:20:00 PM,10/10/2019 03:20:00 PM,07/30/2019,Transfer,Partner,Cat,Intact Female,2 months,Domestic Shorthair,Black
18,A806393,Coby,10/10/2019 02:44:00 PM,10/10/2019 02:44:00 PM,10/10/2007,Return to Owner,NaN,Dog,Spayed Female,12 years,German Shepherd Mix,Black/Tan
19,A805540,Susie,10/10/2019 01:56:00 PM,10/10/2019 01:56:00 PM,03/28/2018,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair,Black

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [15]:
type(shelter_data)

pandas.core.frame.DataFrame

In [16]:
# Now that data is read let's look at it's shape
print(shelter_data.shape)

(109305, 12)

In [17]:
# What are the names of the columns
print(shelter_data.columns)

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [18]:
# What are the different data types present in our data
print(shelter_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109305 entries, 0 to 109304
Data columns (total 12 columns):
Animal ID           109305 non-null object
Name                74849 non-null object
DateTime            109305 non-null object
MonthYear           109305 non-null object
Date of Birth       109305 non-null object
Outcome Type        109299 non-null object
Outcome Subtype     49828 non-null object
Animal Type         109305 non-null object
Sex upon Outcome    109302 non-null object
Age upon Outcome    109287 non-null object
Breed               109305 non-null object
Color               109305 non-null object
dtypes: object(12)
memory usage: 10.0+ MB
None

In [19]:
# We can find the type of a particular columns in a data frame in this way.
ID_series = shelter_data['Animal ID']
shelter_data['Animal ID'].dtypes

dtype('O')

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [20]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [22]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

(5,)

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [23]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [28]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# change from list_of_lists to just a flattened list

elements = [x[0] for x in list_of_lists] # this is list comprehension

# create custom indices for your series
ind = ['housepet', 'better housepet', 'giant housepet', 'NOT a housepet', 'tropical housepet']

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(list_of_lists, index=ind)
list_of_elements_series = pd.Series(elements, index =ind)

# print your series
print(list_of_lists_series)
# type(list_of_lists_series)
print('\n')
print(list_of_elements_series)

housepet               [cat]
better housepet        [dog]
giant housepet       [horse]
NOT a housepet         [cow]
tropical housepet    [macaw]
dtype: object


housepet               cat
better housepet        dog
giant housepet       horse
NOT a housepet         cow
tropical housepet    macaw
dtype: object

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [29]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [30]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [34]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(int)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
# students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
# students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

In [36]:
students_df.age.median()

26.0

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [37]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [38]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [48]:
students_df.rename(columns={'AGE': 'Years'})

          NAME Years      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [49]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [50]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [51]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [52]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [53]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [ ]:
l = [1, 2, 3, 4, 5]
l[[0, 5]]

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [54]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [55]:
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [56]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [57]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [58]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [59]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [60]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [64]:
# return the last item in the last row using iloc
students_df.iloc[-1,-1]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [65]:
# return the last item in the last column using iloc
students_df.iloc[-1,-1]

'New york'

### What if we only want certain columns or rows?

In [66]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [67]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [68]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [69]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [70]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [71]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [72]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [73]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [74]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [75]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [76]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [77]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [78]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [79]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [80]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [81]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [82]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [83]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [86]:
# return the first and last rows using one loc command
students_df.loc[["Samantha", "Dante"]]

         age      city
name
Samantha  35   Houston
Dante     26  New york

### Boolean Subsetting

In [87]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [90]:
# The statement data[‘name’] == ‘Samantha’] produces a Pandas Series with a True/False value for every row
# in the ‘data’ DataFrame, where there are “True” values for the rows where the name is “Samantha”.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [91]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [92]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [93]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [94]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []

### Lesson Recap
Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)

`.iloc` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

`.iloc` will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with python/numpy slice semantics).

`.loc` is primarily label based, but may also be used with a boolean array.

#### Warning Note that contrary to usual python slices, both the start and the stop are included.

`.loc` will raise a keyError when any items are not found.

### Pandas
- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### CLASS ASSIGNMENT
Now that we have all of these new tools in our tool belt, use these tools on the shelter data set! 
- Use `shelter_data.columns` to get the list of column names.
- Subset the data by '`Outcome Subtype`.
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column. 
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column with only `Cat`. 
- Play around with your new tools on the data set.
- For extra credit: What are the data types returned from the different subsetting? Is what returned a series or dataframe?

In [95]:
import pandas as pd
shelter_data = pd.read_csv(
    'https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A806449,NaN,10/11/2019 11:27:00 AM,10/11/2019 11:27:00 AM,10/11/2018,Euthanasia,NaN,Other,Unknown,NaN,Bat Mix,Black
1,A802452,Hobbey,10/11/2019 11:04:00 AM,10/11/2019 11:04:00 AM,02/18/2019,Return to Owner,NaN,Dog,Intact Male,7 months,German Shepherd Mix,Black/Tan
2,A800276,Porkchop,10/10/2019 07:30:00 PM,10/10/2019 07:30:00 PM,09/19/2004,Return to Owner,NaN,Dog,Intact Male,15 years,Australian Cattle Dog,Tan
3,A806032,NaN,10/10/2019 06:25:00 PM,10/10/2019 06:25:00 PM,07/21/2019,Adoption,NaN,Cat,Intact Female,2 months,Domestic Shorthair,Black/White
4,A806431,NaN,10/10/2019 06:13:00 PM,10/10/2019 06:13:00 PM,09/18/2019,Transfer,Partner,Cat,Unknown,3 weeks,Domestic Shorthair,Black

In [124]:
# Use shelter_data.columns to get the list of column names.

shelter_data.columns

# Subset the data by 'Outcome Subtype.

shelter_data.loc[:,"Outcome Subtype"]

# Subset the data by 'Outcome Subtype Adoption and only return 
# the Animal Type column.

shelter_data.loc[shelter_data["Outcome Type"] == "Adoption","Animal Type"]

# Subset the data by 'Outcome Subtype Adoption and only return 
# the Animal Type column with only Cat.

shelter_data.loc[(shelter_data["Outcome Type"] == "Adoption") & 
                 (shelter_data["Animal Type"] == "Cat"),"Animal Type"]

# Play around with your new tools on the data set. For extra credit: 
# What are the data types returned from the different subsetting? 
# Is what returned a series or dataframe?

type(shelter_data.loc[(shelter_data["Outcome Type"] == "Adoption") & 
                 (shelter_data["Animal Type"] == "Cat"),"Animal Type"])

pandas.core.series.Series